       >>SOURCE FORMAT FREE
identification division.
program-id. 1-BasicStructure.
author. Mauricio Rodriguez.
date-written. 01/10/2022.
environment division.

data division.
working-storage section.
*> Define variables

procedure division.
*> Define procedures
       stop run.
end program 1-BasicStructure.
